Hcubedmeta/Stm32f1-Tutorial/ADC-USART/main.c
#include "stm32f10x.h"                  // Device header
#include "stm32f10x_gpio.h"             // Keil::Device:StdPeriph Drivers:GPIO
#include "stm32f10x_rcc.h"              // Keil::Device:StdPeriph Drivers:RCC
#include "stm32f10x_adc.h"              // Keil::Device:StdPeriph Drivers:ADC
#include "USART.h"
#include "KALMAN.h"

float vrui_ADC_Value1;
void Delay_ms(uint16_t _time);
void GPIO_Config(void);
void ADC_Config (void);
unsigned int ADCx_Read(void);
int Map(int x, int in_min, int in_max, int out_min, int out_max);



int main(){
	GPIO_Config();
	ADC_Config();
	usart1_Init();
	SimpleKalmanFilter(2,2,0.001);
	while(1){
		vrui_ADC_Value1 = ADCx_Read();
		float  value = (uint8_t)updateEstimate((float)vrui_ADC_Value1);
		printf("ADC: %f\n",value);
		GPIO_ResetBits(GPIOC,GPIO_Pin_13);
		Delay_ms(500);
	}
}

void Delay_ms(uint16_t _time){
	uint16_t i,j;
	for(i = 0; i < _time; i++){
		for(j = 0; j < 0x2AFF; j++);
	}
}

void GPIO_Config(void){
  GPIO_InitTypeDef  GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
	GPIO_InitTypeDef GPIOx;
	GPIOx.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIOx.GPIO_Pin = GPIO_Pin_13;
	GPIOx.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC,&GPIOx);
}

void ADC_Config(void){
	ADC_InitTypeDef 	ADC_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
	
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
	ADC_InitStructure.ADC_ExternalTrigConv = 	ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 1;	
 	ADC_Init(ADC1, &ADC_InitStructure);
	
	ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_55Cycles5);
	ADC_Cmd(ADC1, ENABLE);
	ADC_ResetCalibration(ADC1);
	while(ADC_GetResetCalibrationStatus(ADC1));
	ADC_StartCalibration(ADC1);
	while(ADC_GetCalibrationStatus(ADC1));
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

unsigned int ADCx_Read(void){
	return(ADC_GetConversionValue(ADC1));
}

int Map(int x, int in_min, int in_max, int out_min, int out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

